### Rose Tovar
### Books
### 9/15/2022

![png](Book_ERD.png)

In [1]:
# imports
import pandas as pd
from sqlalchemy import create_engine
import pymysql
from sqlalchemy_utils import create_database, database_exists

pymysql.install_as_MySQLdb()

In [2]:
# Original Flat Data
df = pd.read_csv("./Data/data.csv")
df.head()

,First Name,Last Name,Email,Book Title,Book Author
0,John,Doe,JD@books.com,The Shining,Stephen King
1,John,Doe,JD@books.com,It,Stephen King
2,John,Doe,JD@books.com,The Great Gatsby,F. Scott Fitzgerald
3,Robin,Smith,Robin@books.com,The Call of the Wild,Jack London
4,Robin,Smith,Robin@books.com,Pride and Prejudice,Jane Austen

In [3]:
# creating connection test
pwd = 'test'
uname = 'root'

conn = f'mysql+pymysql://{uname}:{pwd}@localhost/Books'
    
engine = create_engine(conn)
engine

Engine(mysql+pymysql://root:***@localhost/Books)

In [4]:
# checking if database exist
if database_exists(conn) == False:
    create_database(conn)
else:
    print('Database already exist')

Database already exist

### importing data

In [5]:
users = pd.read_csv('./Data/users.csv')
users.head()
users.to_sql('users', engine, if_exists='replace')

3

In [6]:
books = pd.read_csv('./Data/books.csv')
books.head()
books.to_sql('books', engine, if_exists='replace')

6

In [7]:
author = pd.read_csv('./Data/authors.csv')
author.head()
author.to_sql('authors', engine, if_exists='replace')

5

In [8]:
favorites = pd.read_csv('./Data/favorites.csv')
favorites.head()
favorites.to_sql('favorites', engine, if_exists='replace')

7

### Testing Database

In [9]:
q = """
SHOW TABLES
"""

pd.read_sql(q, engine)

  Tables_in_Books
0         authors
1           books
2       favorites
3           users

In [10]:
q = """
SELECT b.title, f.user_id
FROM books AS b
JOIN favorites AS f ON b.id = f.book_id
WHERE f.user_id = 
    (SELECT u.id FROM users AS u WHERE (u.last_name = "Doe" AND u.first_name = "John"));


"""

pd.read_sql(q, engine)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1